---
kind: type
id: T:Autodesk.Revit.DB.Architecture.TopographyLinkType
source: html/773d38dc-a1c9-a74e-2c4b-70bcb174059b.htm
---
# Autodesk.Revit.DB.Architecture.TopographyLinkType

This class represents the site file brought into the current Revit document.

## Syntax (C#)
```csharp
public class TopographyLinkType : ElementType
```